results/final/nginx-scx-compare-20260724-tested-2541464-runs10/run-6/quiet_scx_normal_wrk.txt
Running 10s test @ http://127.0.0.1:18082/
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.44ms  244.08us   9.90ms   93.37%
    Req/Sec    10.91k     1.58k   12.89k    93.57%
  Latency Distribution
     50%    1.40ms
     75%    1.50ms
     90%    1.62ms
     99%    2.23ms
  153391 requests in 10.01s, 26.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 32
Requests/sec:  15322.25
Transfer/sec:      2.67MB